#include <iostream>

int main(int argc, char** argv) 
{
	// 常量
	const int i1{ 1 };
	int const i2{ 1 };

	////////////////////////////////////////////////////////////////
	// 常量指针
	int i{ 0 };
	const int* pi1 = &i;
	int const* pi2 = &i;

	//1 可以修改指针的值
	pi1 = nullptr;
	pi2 = nullptr;

	//2 不允许修改指针指向的值
	//(*pi1) = 1;
	//(*pi2) = 1;

	//////////////////////////////////////////////////////////////
	// 指针常量
	int* const pi3 = &i;

	//1 不可以修改指针的值
	//pi3 = nullptr;

	//2 可以修改指针指向的值
	(*pi3) = 3;

	//////////////////////////////////////////////////////////////
	//指向一个常量的指针常量
	const int* const pi4 = &i;
	//1 不可以修改指针的值
	//pi3 = nullptr;

	//2 可以修改指针指向的值
	(*pi3) = 3;

	return 0;
}